{
  "education": [
    {
      "awards_achievements": [
        "Scholarship",
        "Dean's List in all the semesters",
        "GPA: 3.8/4.0"
      ],
      "degree": "Diploma Degree",
      "department": "Computer Programming",
      "duration": "2019-2021",
      "school_name": "Georgian College"
    },
    {
      "awards_achievements": null,
      "degree": "Master of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2016-2018",
      "school_name": "XYZ university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JeshanChhabra",
  "highlighted_projects": [
    {
      "description": "Developed an application which can control any PC in the same network by running the server on the client(client- server communication).",
      "git_url": "https://github.com/Jeshan26/Network_Pc_Comparison",
      "name": "Network-PC Comparison"
    },
    {
      "description": "Developed an E-Commerce website that performs CRUD Operations and is connected to Database(MongoDb). This is a frontend website that stores the users account details and share a common static page that lists all the items added.",
      "git_url": null,
      "name": "E-Commerce website"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a solution to monitor the hardware specifications and usage of each node in the cluster over time with help of Bash. All the data received by the automated crontab job and  is stored in the PostgreSQL server which runs inside the docker container.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Implemented the twitter Rest API to create,read and delete the tweets. Used Spring, Java Libraries, Maven etc to build the application and tested and deployed using JUnit and Docker respectively. ",
        "JDBC App: Implemented a database connectivity application which connects to PostgreSQL database and perform manupulation on tables. It also implements the CRUD Operations with JDBC API'S which allows us to create, read, update and delete in the database.",
        "Grep App: Developed the Linux grep command in Java to search the text pattern recursively in a given directory and output the matched result to the file path provided."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developing a stateless Data processing application(a trading platform based on IEX Cloud API) that performs the CRUD operations and persist the data in the database. This is a REST API which can be consumed by other applications in order to manage user profiles and monitor trade performances.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Jeshan Chhabra",
  "others": [
    {
      "bullets": [
        "Udacity Machine Learning (2019)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Winner",
        " "
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Cricket player in the local city club",
        "Competitive gaming",
        "Writing poems"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Demonstrated expertise in translating client needs into easy-to-understand software solutions. Proficient in troubleshooting/debugging the applications to achieve quick results. Developed various projects with technologies like  JAVA,Springboot, Docker/ Sql and so on which has strengthened my skills and made me proficent in solving client needs.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Intransigence",
      "description": "Developed UI/UX components using Angular framework with a pre-designed business Model and with my own innovation. I developed REST API's that managed communication with the backend in NODE.JS. Also tested them using POSTMAN..",
      "duration": "April 2020 - September 2020",
      "title": "Junior Developer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "REST API's",
      "JIRA",
      "Javascript",
      "Microsoft Office"
    ],
    "familiar": [
      "CSS",
      "Vue.js",
      "HTML",
      "NODE.JS",
      "Angular"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Spring Boot",
      "Git"
    ]
  },
  "summary": "Logical and results-driven Software Developer who always aims to complete a given task on desired time.Technically, proficient and analytical problem solver with a calm and focused demeanor. I'm skilled in developing Java Applications and connecting them with the databases. Apart from this, I always enjoy playing Cricket which also helped me to be a great team player. To conclude, i am looking for the oppurtunity to showcase my skillset in the backend developer role."
}
